MicrochipTech/PIC32CXBZx_WBZx51_BLE_HANDOVER_CAN/apps/001_peripheral/firmware/src/packs/WBZ451H_DFP/component/pmu.h
/* -------- PMU_PMUCMODE : (PMU Offset: 0x20) (R/W 32)  -------- */
#define PMU_PMUCMODE_RESETVALUE               _UINT32_(0x00)                                       /*  (PMU_PMUCMODE)   Reset Value */

#define PMU_PMUCMODE_CVREG4OCTRL_Pos          _UINT32_(0)                                          /* (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_CVREG4OCTRL_Msk          (_UINT32_(0x1F) << PMU_PMUCMODE_CVREG4OCTRL_Pos)     /* (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_CVREG4OCTRL(value)       (PMU_PMUCMODE_CVREG4OCTRL_Msk & (_UINT32_(value) << PMU_PMUCMODE_CVREG4OCTRL_Pos)) /* Assigment of value for CVREG4OCTRL in the PMU_PMUCMODE register */
#define PMU_PMUCMODE_CVREG3OCTRL_Pos          _UINT32_(8)                                          /* (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_CVREG3OCTRL_Msk          (_UINT32_(0x1F) << PMU_PMUCMODE_CVREG3OCTRL_Pos)     /* (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_CVREG3OCTRL(value)       (PMU_PMUCMODE_CVREG3OCTRL_Msk & (_UINT32_(value) << PMU_PMUCMODE_CVREG3OCTRL_Pos)) /* Assigment of value for CVREG3OCTRL in the PMU_PMUCMODE register */
#define PMU_PMUCMODE_CVREG2OCTROL_Pos         _UINT32_(16)                                         /* (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_CVREG2OCTROL_Msk         (_UINT32_(0x1F) << PMU_PMUCMODE_CVREG2OCTROL_Pos)    /* (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_CVREG2OCTROL(value)      (PMU_PMUCMODE_CVREG2OCTROL_Msk & (_UINT32_(value) << PMU_PMUCMODE_CVREG2OCTROL_Pos)) /* Assigment of value for CVREG2OCTROL in the PMU_PMUCMODE register */
#define PMU_PMUCMODE_ADCBOR_Pos               _UINT32_(21)                                         /* (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_ADCBOR_Msk               (_UINT32_(0x1) << PMU_PMUCMODE_ADCBOR_Pos)           /* (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_ADCBOR(value)            (PMU_PMUCMODE_ADCBOR_Msk & (_UINT32_(value) << PMU_PMUCMODE_ADCBOR_Pos)) /* Assigment of value for ADCBOR in the PMU_PMUCMODE register */
#define PMU_PMUCMODE_BUCKBOR_Pos              _UINT32_(22)                                         /* (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_BUCKBOR_Msk              (_UINT32_(0x1) << PMU_PMUCMODE_BUCKBOR_Pos)          /* (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_BUCKBOR(value)           (PMU_PMUCMODE_BUCKBOR_Msk & (_UINT32_(value) << PMU_PMUCMODE_BUCKBOR_Pos)) /* Assigment of value for BUCKBOR in the PMU_PMUCMODE register */
#define PMU_PMUCMODE_MLDOEXTBOR_Pos           _UINT32_(23)                                         /* (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_MLDOEXTBOR_Msk           (_UINT32_(0x1) << PMU_PMUCMODE_MLDOEXTBOR_Pos)       /* (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_MLDOEXTBOR(value)        (PMU_PMUCMODE_MLDOEXTBOR_Msk & (_UINT32_(value) << PMU_PMUCMODE_MLDOEXTBOR_Pos)) /* Assigment of value for MLDOEXTBOR in the PMU_PMUCMODE register */
#define PMU_PMUCMODE_CVREG1OCTRL_Pos          _UINT32_(24)                                         /* (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_CVREG1OCTRL_Msk          (_UINT32_(0x1F) << PMU_PMUCMODE_CVREG1OCTRL_Pos)     /* (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_CVREG1OCTRL(value)       (PMU_PMUCMODE_CVREG1OCTRL_Msk & (_UINT32_(value) << PMU_PMUCMODE_CVREG1OCTRL_Pos)) /* Assigment of value for CVREG1OCTRL in the PMU_PMUCMODE register */
#define PMU_PMUCMODE_CBUCKMODE_Pos            _UINT32_(29)                                         /* (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_CBUCKMODE_Msk            (_UINT32_(0x1) << PMU_PMUCMODE_CBUCKMODE_Pos)        /* (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_CBUCKMODE(value)         (PMU_PMUCMODE_CBUCKMODE_Msk & (_UINT32_(value) << PMU_PMUCMODE_CBUCKMODE_Pos)) /* Assigment of value for CBUCKMODE in the PMU_PMUCMODE register */
#define PMU_PMUCMODE_CMLDOEN_Pos              _UINT32_(30)                                         /* (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_CMLDOEN_Msk              (_UINT32_(0x1) << PMU_PMUCMODE_CMLDOEN_Pos)          /* (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_CMLDOEN(value)           (PMU_PMUCMODE_CMLDOEN_Msk & (_UINT32_(value) << PMU_PMUCMODE_CMLDOEN_Pos)) /* Assigment of value for CMLDOEN in the PMU_PMUCMODE register */
#define PMU_PMUCMODE_CBUCKEN_Pos              _UINT32_(31)                                         /* (PMU_PMUCMODE)  Position */
#define PMU_PMUCMODE_CBUCKEN_Msk              (_UINT32_(0x1) << PMU_PMUCMODE_CBUCKEN_Pos)          /* (PMU_PMUCMODE)  Mask */
#define PMU_PMUCMODE_CBUCKEN(value)           (PMU_PMUCMODE_CBUCKEN_Msk & (_UINT32_(value) << PMU_PMUCMODE_CBUCKEN_Pos)) /* Assigment of value for CBUCKEN in the PMU_PMUCMODE register */
#define PMU_PMUCMODE_Msk                      _UINT32_(0xFFFF1F1F)                                 /* (PMU_PMUCMODE) Register Mask  */


/* -------- PMU_PMUSTATUS : (PMU Offset: 0x24) (R/W 32)  -------- */
#define PMU_PMUSTATUS_RESETVALUE              _UINT32_(0x00)                                       /*  (PMU_PMUSTATUS)   Reset Value */

#define PMU_PMUSTATUS_PMUSTATUS_Pos           _UINT32_(0)                                          /* (PMU_PMUSTATUS)  Position */
#define PMU_PMUSTATUS_PMUSTATUS_Msk           (_UINT32_(0x1F) << PMU_PMUSTATUS_PMUSTATUS_Pos)      /* (PMU_PMUSTATUS)  Mask */
#define PMU_PMUSTATUS_PMUSTATUS(value)        (PMU_PMUSTATUS_PMUSTATUS_Msk & (_UINT32_(value) << PMU_PMUSTATUS_PMUSTATUS_Pos)) /* Assigment of value for PMUSTATUS in the PMU_PMUSTATUS register */
#define PMU_PMUSTATUS_WCMRM_Pos               _UINT32_(5)                                          /* (PMU_PMUSTATUS)  Position */
#define PMU_PMUSTATUS_WCMRM_Msk               (_UINT32_(0x1) << PMU_PMUSTATUS_WCMRM_Pos)           /* (PMU_PMUSTATUS)  Mask */
#define PMU_PMUSTATUS_WCMRM(value)            (PMU_PMUSTATUS_WCMRM_Msk & (_UINT32_(value) << PMU_PMUSTATUS_WCMRM_Pos)) /* Assigment of value for WCMRM in the PMU_PMUSTATUS register */
#define PMU_PMUSTATUS_PMUANA_BUCKBOR_Pos      _UINT32_(6)                                          /* (PMU_PMUSTATUS)  Position */
#define PMU_PMUSTATUS_PMUANA_BUCKBOR_Msk      (_UINT32_(0x1) << PMU_PMUSTATUS_PMUANA_BUCKBOR_Pos)  /* (PMU_PMUSTATUS)  Mask */
#define PMU_PMUSTATUS_PMUANA_BUCKBOR(value)   (PMU_PMUSTATUS_PMUANA_BUCKBOR_Msk & (_UINT32_(value) << PMU_PMUSTATUS_PMUANA_BUCKBOR_Pos)) /* Assigment of value for PMUANA_BUCKBOR in the PMU_PMUSTATUS register */
#define PMU_PMUSTATUS_BSSEDATA_Pos            _UINT32_(8)                                          /* (PMU_PMUSTATUS)  Position */
#define PMU_PMUSTATUS_BSSEDATA_Msk            (_UINT32_(0xFFFF) << PMU_PMUSTATUS_BSSEDATA_Pos)     /* (PMU_PMUSTATUS)  Mask */
#define PMU_PMUSTATUS_BSSEDATA(value)         (PMU_PMUSTATUS_BSSEDATA_Msk & (_UINT32_(value) << PMU_PMUSTATUS_BSSEDATA_Pos)) /* Assigment of value for BSSEDATA in the PMU_PMUSTATUS register */
#define PMU_PMUSTATUS_BSSENUM_Pos             _UINT32_(24)                                         /* (PMU_PMUSTATUS)  Position */
#define PMU_PMUSTATUS_BSSENUM_Msk             (_UINT32_(0x7F) << PMU_PMUSTATUS_BSSENUM_Pos)        /* (PMU_PMUSTATUS)  Mask */
#define PMU_PMUSTATUS_BSSENUM(value)          (PMU_PMUSTATUS_BSSENUM_Msk & (_UINT32_(value) << PMU_PMUSTATUS_BSSENUM_Pos)) /* Assigment of value for BSSENUM in the PMU_PMUSTATUS register */
#define PMU_PMUSTATUS_BSSERR_Pos              _UINT32_(31)                                         /* (PMU_PMUSTATUS)  Position */
#define PMU_PMUSTATUS_BSSERR_Msk              (_UINT32_(0x1) << PMU_PMUSTATUS_BSSERR_Pos)          /* (PMU_PMUSTATUS)  Mask */
#define PMU_PMUSTATUS_BSSERR(value)           (PMU_PMUSTATUS_BSSERR_Msk & (_UINT32_(value) << PMU_PMUSTATUS_BSSERR_Pos)) /* Assigment of value for BSSERR in the PMU_PMUSTATUS register */
#define PMU_PMUSTATUS_Msk                     _UINT32_(0xFFFFFF7F)                                 /* (PMU_PMUSTATUS) Register Mask  */


/* -------- PMU_PMUSEQ1 : (PMU Offset: 0x28) (R/W 32)  -------- */
#define PMU_PMUSEQ1_RESETVALUE                _UINT32_(0x00)                                       /*  (PMU_PMUSEQ1)   Reset Value */

#define PMU_PMUSEQ1_DELAY_Pos                 _UINT32_(0)                                          /* (PMU_PMUSEQ1)  Position */
#define PMU_PMUSEQ1_DELAY_Msk                 (_UINT32_(0x3F) << PMU_PMUSEQ1_DELAY_Pos)            /* (PMU_PMUSEQ1)  Mask */
#define PMU_PMUSEQ1_DELAY(value)              (PMU_PMUSEQ1_DELAY_Msk & (_UINT32_(value) << PMU_PMUSEQ1_DELAY_Pos)) /* Assigment of value for DELAY in the PMU_PMUSEQ1 register */
#define PMU_PMUSEQ1_CMPBVAL_Pos               _UINT32_(6)                                          /* (PMU_PMUSEQ1)  Position */
#define PMU_PMUSEQ1_CMPBVAL_Msk               (_UINT32_(0x1) << PMU_PMUSEQ1_CMPBVAL_Pos)           /* (PMU_PMUSEQ1)  Mask */
#define PMU_PMUSEQ1_CMPBVAL(value)            (PMU_PMUSEQ1_CMPBVAL_Msk & (_UINT32_(value) << PMU_PMUSEQ1_CMPBVAL_Pos)) /* Assigment of value for CMPBVAL in the PMU_PMUSEQ1 register */
#define PMU_PMUSEQ1_CMD_Pos                   _UINT32_(7)                                          /* (PMU_PMUSEQ1)  Position */
#define PMU_PMUSEQ1_CMD_Msk                   (_UINT32_(0x1) << PMU_PMUSEQ1_CMD_Pos)               /* (PMU_PMUSEQ1)  Mask */
#define PMU_PMUSEQ1_CMD(value)                (PMU_PMUSEQ1_CMD_Msk & (_UINT32_(value) << PMU_PMUSEQ1_CMD_Pos)) /* Assigment of value for CMD in the PMU_PMUSEQ1 register */
#define PMU_PMUSEQ1_SPIRADDR_Pos              _UINT32_(8)                                          /* (PMU_PMUSEQ1)  Position */
#define PMU_PMUSEQ1_SPIRADDR_Msk              (_UINT32_(0xFF) << PMU_PMUSEQ1_SPIRADDR_Pos)         /* (PMU_PMUSEQ1)  Mask */
#define PMU_PMUSEQ1_SPIRADDR(value)           (PMU_PMUSEQ1_SPIRADDR_Msk & (_UINT32_(value) << PMU_PMUSEQ1_SPIRADDR_Pos)) /* Assigment of value for SPIRADDR in the PMU_PMUSEQ1 register */
#define PMU_PMUSEQ1_SPIDATA_Pos               _UINT32_(16)                                         /* (PMU_PMUSEQ1)  Position */
#define PMU_PMUSEQ1_SPIDATA_Msk               (_UINT32_(0xFFFF) << PMU_PMUSEQ1_SPIDATA_Pos)        /* (PMU_PMUSEQ1)  Mask */
#define PMU_PMUSEQ1_SPIDATA(value)            (PMU_PMUSEQ1_SPIDATA_Msk & (_UINT32_(value) << PMU_PMUSEQ1_SPIDATA_Pos)) /* Assigment of value for SPIDATA in the PMU_PMUSEQ1 register */
#define PMU_PMUSEQ1_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (PMU_PMUSEQ1) Register Mask  */


